rezayazdanparast1376/ESP8266/esp8266_send_command.c
#include "esp8266.h"

#include <string.h>
// ================================================== Basic Command ==================================================

// 1.  AT           – Test AT startup
// 2.  AT+RST       – Restart module
// 3.  AT+GMR       – View version info
// 4.  AT+GSLP      – Enter deep-sleep mode
// 5.  ATE          – AT commands echo
// 6.  AT+RESTORE   – Factory reset
// 7.  AT+UART      – UART configuration
// 8.  AT+UART_CUR  – current UART configuration
// 9.  AT+UART_DEF  – default UART configuration
// 10. AT+SLEEP     – sleep mode
// 11. AT+RFPOWER   – set maximum value of RF TX Power
// 12. AT+RFVDD     – set RF TX Power according to VDD33
// ===================================================================================================================




/**
 * @addtogroup Basic_at_commands
 * 
 * @brief The type of this command is "executed". It's used to test the setup function of your wireless WiFi module.
 * 
 * @typedef Type Execute
 * 
 * @test serial was down
 * 
 * @result OK
*/
Void __esp8266_Send_Test_AT_cmd(Void) {
    const char send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT%c%c", (Char)CARRIAR_RETURN, LINE_FEED);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * @addtogroup Basic_at_commands
 * 
 * @brief  Restart module 
 * The type of this command is "executed". It’s used to restart the module. 
 * 
*/
Void __esp8266_Send_AT_RST_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+RST%c%c", (Char)CARRIAR_RETURN, LINE_FEED);

    esp8266_uart_send(send_buf, strlen(send_buf));   
}



/**
 * @addtogroup Basic_at_commands
 * 
 * @brief  View version info 
 * This AT command is used to check the version of AT commands and SDK that you are using, the type of which is "executed".
 * 
*/
Void __esp8266_Send_AT_GMR_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+GMR%c%c", (Char)CARRIAR_RETURN, (Char)LINE_FEED);

    esp8266_uart_send(send_buf, strlen(send_buf)); 
}




// AT+GSLP
/**
 * @addtogroup Basic_at_commands
 * 
 * @brief Enter deep-sleep mode 
 * This command is used to invoke the deep-sleep mode of the module, the type of which is "set". 
 * A minor adjustment has to be made before the module enter this deep sleep mode, i.e., connect XPD_DCDC with EXT_RSTB via 0 ohm resistor. 
 * 
*/
Void __esp8266_Send_AT_GSLP_cmd(UInt16 time) {
    UInt8 send_buf[35] = {0};
    sprintf((Char*)send_buf, "AT+GSLP=%c%c", time, (Char)CARRIAR_RETURN, LINE_FEED);

    esp8266_uart_send(send_buf, strlen(send_buf)); 
}




// ATE
/**
 * @addtogroup Basic_at_commands
 * 
 * @brief AT commands echo  
 * This command ATE is an AT trigger command echo. It means that entered commands can be echoed back to the sender when ATE command is used. Two parameters are possible. 
 * The command returns "OK" in normal cases and "ERROR" when a parameter other than 0 or 1 was specified
 * 
*/
Void __esp8266_Send_ATE_cmd(
    Bool echo
) {
    UInt8 send_buf[35] = {0};
    
    if (echo == true) {
        sprintf((Char*)send_buf, "ATE1%c%c", (Char)CARRIAR_RETURN, (Char)LINE_FEED);
    }
    else if (echo == false) {
        sprintf((Char*)send_buf, "ATE0%c%c", (Char)CARRIAR_RETURN, (Char)LINE_FEED);
    }
    
    esp8266_uart_send(send_buf, strlen(send_buf)); 
}




// AT+RESTORE
/**
 * @addtogroup Basic_at_commands
 * 
 * @brief Factory reset 
 * This command is used to reset all parameters saved in flash (according to appendix), restore the factory default settings of the module. 
 * The chip will be restarted when this command is executed. 
 * 
 * @note  Restore factory default settings. The chip will restart.
 * 
*/
Void __esp8266_Send_AT_RESTORE_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+RESTORE%c%c", (Char)CARRIAR_RETURN, LINE_FEED);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// AT+UART_CUR
// AT+UART_CUR=<baudrate>, <databits>, <stopbits>, <parity>, <flow control>
// Example AT+UART_CUR=115200, 8, 1, 0, 3
/**
 * @addtogroup Basic_at_commands
 * 
 * @brief This command sets the current UART configuration; it does not write to the flash. Hence there is no change in the default baudrate.
 * 
 * @param baudrate     Baudrate range: 110 to 115200*40 (4.608 Mega)
 * @param databits     [ 5: 5 bits data, 6: 6 bits data, 7: 7 bits data, 8: 8 bits data]
 * @param stopbits     [ 1: 1 bit stop bit, 2: 1.5 bit stop bit, 3: 2 bit stop bit ]
 * @param parity       [ 0: None, 1: Odd, 2: EVEN ]
 * @param flow_control [0: disable flow control, 1: enable RTS, 2: enable CTS, 3: enable both RTS and CTS]
 * 
*/
Void __esp8266_Send_AT_UART_CUR_cmd(
    UInt16 baudrate, 
    UInt8  databits, 
    UInt8  stopbits, 
    UInt8  parity, 
    UInt8  flow_control
) {

    UInt8 send_buf[55] = {0};

    sprintf((Char*)send_buf, "AT+UART_CUR=%d, %d, %d, %d, %d%c%c", baudrate, databits, stopbits, parity, flow_control, (Char)CARRIAR_RETURN, LINE_FEED);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// AT+UART_DEF – default UART configuration

/**
 * @addtogroup Basic_at_commands
 * 
 * @brief This command sets the UART configuration and save it to flash. It is stored as the default parameter and will also be used as the default baudrate henceforth.
 * @example AT+UART_DEF=115200, 8, 1, 0, 3
 * 
 * @param baudrate     Baudrate range: 110 to 115200*40 (4.608 Mega)
 * @param databits     [ 5: 5 bits data, 6: 6 bits data, 7: 7 bits data, 8: 8 bits data]
 * @param stopbits     [ 1: 1 bit stop bit, 2: 1.5 bit stop bit, 3: 2 bit stop bit ]
 * @param parity       [ 0: None, 1: Odd, 2: EVEN ]
 * @param flow_control [0: disable flow control, 1: enable RTS, 2: enable CTS, 3: enable both RTS and CTS]
 * 
*/ 
Void __esp8266_Send_AT_UART_DEF_cmd(
    UInt16 baudrate, 
    UInt8  databits, 
    UInt8  stopbits, 
    UInt8  parity, 
    UInt8  flow_control
) {
    UInt8 send_buf[55] = {0};

    sprintf((Char*)send_buf, "AT+UART_DEF=%d, %d, %d, %d, %d%c%c", baudrate, databits, stopbits, parity, flow_control, (Char)CARRIAR_RETURN, LINE_FEED);

    esp8266_uart_send(send_buf, strlen(send_buf));
}






// 10. AT+SLEEP – sleep mode 
/**
 * @addtogroup Basic_at_commands
 * 
 * @brief This command sets ESP8266 sleep mode. It can only be used in station mode, default to be modem sleep mode.
 * 
 * @example  
 *  Command 
 *  AT+SLEEP?
 *  
 *  Response
 *  +SLEEP : <sleep mode> 
 *  
 *  OK
*/
Void __esp8266_Send_AT_SLEEP_req_cmd(Void) {
    UInt8 send_buf[35] = {0};

