rezayazdanparast1376/ESP8266/esp8266_send_command.c
    sprintf((Char*)send_buf, "AT+SLEEP?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}



// AT+SLEEP=<sleep mode>
/**
 * @addtogroup Basic_at_commands
 * 
 * @brief This command sets ESP8266 sleep mode. It can only be used in station mode, default to be modem sleep mode.
 * 
 * @param sleep_mode [0 : disable sleep mode, 1 : light-sleep mode, 2 : modem-sleep mode]
 * 
 * @example 
 * Command 
 * AT+SLEEP=<sleep mode>
 * Response 
 * OK
 */
Void __esp8266_Send_AT_SLEEP_set_cmd(
    UInt8 sleep_mode
) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+SLEEP=%c%c", sleep_mode, (Char)CARRIAR_RETURN, LINE_FEED);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// AT+RFPOWER
/**
 * @addtogroup Basic_at_commands
 * 
 * @brief This command sets the maximum value of ESP8266 RF TX power, it is not precise.
 * @example  Example AT+RFPOWER=50
 * 
 * @param tx_power
 * 
*/
Void __esp8266_Send_AT_RFPOWER_set_cmd(
    UInt8 tx_power
) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+RFPOWER=%c%c", tx_power, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}





// AT+RFVDD
/**
 * @addtogroup Basic_at_commands
 * 
 * @brief This command sets ESP8266 RF TX power according to VDD33. To get the power voltage of ESP8266 VDD3P3, TOUT pin has to be suspended. 
 * TOUT pin has to be suspended to measure VDD33.
 * 
 * @example
 * Command AT+RFVDD?
 * Response +RFVDD:<VDD33> 
 * OK
 * 
 * @param  <VDD33> power voltage of ESP8266 VDD33, unit: 1/1024 V TOUT pin has to be suspended to measure VDD33.
 * 
*/
Void __esp8266_Send_AT_RFVDD_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+RFVDD?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}


/**
 * @addtogroup Basic_at_commands
 * 
 * @brief  AT+RFVDD=<VDD33>
 * @param VDD33 <VDD33> power voltage of ESP8266 VDD33, range [1900, 3300]
*/
Void __esp8266_Send_AT_RFVDD_set_cmd(
    UInt16 VDD33
) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+RFVDD=%c%c", VDD33, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}



// AT+RFVDD
/**
 * @addtogroup Basic_at_commands
 * @brief AT+RFVDD
 * @note  "AT+RFVDD" will automatically set RF TX power according to VDD33. TOUT pin has to be suspended. 
*/
Void __esp8266_Send_AT_RFVDD_req_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+RFVDD%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// AT+CWMODE            Wi-Fi mode(sta/AP/sta+AP),                                  [@deprecated]
// AT+CWMODE_CUR        Wi-Fi mode(sta/AP/sta+AP) Won’t save to Flash
// AT+CWMODE_DEF        Wi-Fi default mode(sta/AP/sta+AP) Save to Flash
// AT+CWJAP             Connect to AP,                                              [@deprecated]
// AT+CWJAP_CUR         Connect to AP, won’t save to Flash
// AT+CWJAP_DEF         Connect to AP, save to Flash
// AT+CWLAPOPT          Set the configuration of command AT+CWLAP
// AT+CWLAP             Lists available APs
// AT+CWQAP             Disconnect from AP
// AT+CWSAP             Set configuration of ESP8266 soft-AP                        [@deprecated]
// AT+CWSAP_CUR         Set configuration of ESP8266 soft-AP Won’t save to Flash.
// AT+CWSAP_DEF         Set configuration of ESP8266 soft-AP Save to Flash.
// AT+CWLIF             Get station’s IP which is connected to ESP8266 soft-AP
// AT+CWDHCP            Enable/Disable DHCP,                                        [@deprecated]
// AT+CWDHCP_CUR        Enable/Disable DHCP, won’t save to Flash
// AT+CWDHCP_DEF        Enable/Disable DHCP, save to Flash
// AT+CWDHCPS_CUR       Set IP range of DHCP server, won’t save to Flash
// AT+CWDHCPS_DEF       Set IP range of DHCP server, save to Flash
// AT+CWAUTOCONN        Connect to AP automatically when power on
// AT+CIPSTAMAC         Set MAC address of ESP8266 station                          [@deprecated]
// AT+CIPSTAMAC_CUR     Set MAC address of ESP8266 station Won’t save to Flash.
// AT+CIPSTAMAC_DEF     Set MAC address of ESP8266 station Save to Flash.
// AT+CIPAPMAC          Set MAC address of ESP8266 soft-AP                          [@deprecated]
// AT+CIPAPMAC_CUR      Set MAC address of ESP8266 soft-AP Won’t save to Flash.
// AT+CIPAPMAC_DEF      Set MAC address of ESP8266 soft-AP Save to Flash.
// AT+CIPSTA            Set IP address of ESP8266 station,                          [@deprecated]
// AT+CIPSTA_CUR        Set IP address of ESP8266 station Won’t save to Flash.
// AT+CIPSTA_DEF        Set IP address of ESP8266 station Save to Flash.
// AT+CIPAP             Set IP address of ESP8266 soft-AP,                          [@deprecated]
// AT+CIPAP_CUR         Set IP address of ESP8266 soft-AP Won’t save to Flash.
// AT+CIPAP_DEF         Set IP address of ESP8266 soft-AP Save to Flash.
// AT+CWSTARTSMART      Start SmartConfig
// AT+CWSTOPSMART       Stop SmartConfig
// AT+CWSTARTDISCOVER   Start the mode that ESP8266 can be found by WeChat
// AT+CWSTOPDISCOVER    Stop the mode that ESP8266 can be found by WeChat
// AT+WPS               Set WPS function
// AT+MDNS              Set MDNS function



/**
 *  Command AT+CWMODE_CUR=?
 *  Response
 * +CWMODE_CUR:( value scope of <mode>) 
 * OK
*/
Void __esp8266_Send_AT_CWMODE_CUR_req_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWMODE_CUR=?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}


/**
 * Command AT+CWMODE_CUR?
 * Response
 * +CWMODE_CUR:<mode> 
 * OK
*/
Void __esp8266_Send_AT_CWMODE_CUR_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWMODE_CUR?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}



 

/**
 * Command AT+CWMODE_CUR=<mode>
 * Response OK
*/
Void __esp8266_Send_AT_CWMODE_CUR_set_cmd(UInt8 mode) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWMODE_CUR=%c%c", mode, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * Command AT+CWMODE_DEF=?
 * Response
 * +CWMODE_DEF:( value scope of <mode>) 
 * OK
*/
Void __esp8266_Send_AT_CWMODE_DEF_req_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWMODE_DEF=?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * Command AT+CWMODE_DEF?
 * Response
 * +CWMODE_DEF:<mode> 
 * OK
*/
Void __esp8266_Send_AT_CWMODE_DEF_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWMODE_DEF?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}



/**
 * Command AT+CWMODE_DEF=<mode>
 * Response OK
*/
Void __esp8266_Send_AT_CWMODE_DEF_set_cmd(UInt8 mode) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWMODE_DEF?%c%c", mode, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}



/**
 * Command AT+CWJAP_CUR?
 * Response
 * +CWJAP_CUR:<ssid>, <bssid>, <channel>, <rssi> 
 * OK
*/
Void __esp8266_Send_AT_CWJAP_CUR_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWJAP_CUR?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}



// Command AT+CWJAP_CUR=<ssid>, <pwd>[, <bssid>]
// Response
// OK 
// or 
// +CWJAP:<error code> 
// FAIL
Void __esp8266_Send_AT_CWJAP_CUR_set_cmd(
    Char* ssid, 
    Char* pwd, 
    Char* bssid
) {
    UInt8 send_buf[35] = {0};

    if (bssid == NULL) {
        sprintf((Char*)send_buf, "AT+CWJAP_CUR=%s, %s%c", ssid, pwd, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CWJAP_CUR=%s, %s, %s%c", ssid, pwd, bssid, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CWJAP_DEF?
// Response
// +CWJAP_DEF:<ssid>, <bssid>, <channel>, <rssi> 
// OK
Void __esp8266_Send_AT_CWJAP_DEF_get_cmd() {
    UInt8 send_buf[35] = {0};

