rezayazdanparast1376/ESP8266/esp8266_send_command.c
    sprintf((Char*)send_buf, "AT+CWJAP_DEF?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CWJAP_DEF=<ssid>, <pwd>[, <bssid>]
// Response
// OK 
// or 
// +CWJAP:<error code> 
// FAIL
Void __esp8266_Send_AT_CWJAP_DEF_set_cmd(
    Char* ssid, 
    Char* pwd, 
    Char* bssid
) {
    UInt8 send_buf[35] = {0};

    if (bssid == NULL) {
        sprintf((Char*)send_buf, "AT+CWJAP_DEF=%s, %s%c", ssid, pwd, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CWJAP_DEF=%s, %s, %s%c", ssid, pwd, bssid, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}






//  Command AT+CWLAPOPT=<sort_enable>, <mask>
//  Response OK or ERROR
Void __esp8266_Send_AT_CWLAPOPT_set_cmd(Bool sort_enable, UInt8 mask) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWLAPOPT=%d, %c%c", sort_enable, mask, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}





// Command AT+CWLAP=<ssid>[, <mac>, <ch>]
// Response
// +CWLAP:<ecn>, <ssid>, <rssi>, <mac>, <ch>, <freq offset>, <freq calibration> 
// OK 
// ERROR
Void __esp8266_Send_AT_CWLAP_set_cmd(Char* ssid, Char* mac, Char* ch) {
    UInt8 send_buf[35] = {0};

    if (mac == NULL && ch == NULL) {
        sprintf((Char*)send_buf, "AT+CWLAP=%s%c", ssid, (Char)CARRIAR_RETURN);
    }
    else if (mac != NULL && ch == NULL) {
        sprintf((Char*)send_buf, "AT+CWLAP=%s, %s%c", ssid, mac, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CWLAP=%s, %s, %s%c", ssid, mac, ch, (Char)CARRIAR_RETURN);
    } 

    esp8266_uart_send(send_buf, strlen(send_buf));
}



// Command AT+CWLAP
// Response
// +CWLAP:<ecn>, <ssid>, <rssi>, <mac>, <ch>, <freq offset>, <freq calibration> 
// OK 
// ERROR
Void __esp8266_Send_AT_CWLAP_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWLAP%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}





// Command AT+CWQAP
Void __esp8266_Send_AT_CWQAP_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWQAP%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}



//  Command AT+CWSAP_CUR?
//  Response +CWSAP_CUR:<ssid>, <pwd>, <chl>, <ecn>, <max conn>, <ssid hidden>
Void __esp8266_Send_AT_CWSAP_CUR_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWSAP_CUR?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}



// Command AT+CWSAP_CUR=<ssid>, <pwd>, <chl>, <ecn>[, <max conn>][, <ssid hidden>]
// Response OK 
// ERROR
Void __esp8266_Send_AT_CWSAP_CUR_set_cmd(
    _In_ Char*    ssid, 
    _In_ Char*    pwd, 
    _In_ UInt8  chl, 
    _In_ UInt8  ecn, 
    _In_ UInt8* max_conn, 
    _In_ UInt8* ssid_hidden
) {
    UInt8 send_buf[35] = {0};

    if (max_conn == NULL || ssid_hidden == NULL) {
        sprintf((Char*)send_buf, "AT+CWSAP_CUR=%s, %s, %d, %c%c", ssid, pwd, chl, ecn, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CWSAP_CUR=%s, %s, %d, %d, %d, %c%c", ssid, pwd, chl, ecn, max_conn, ssid_hidden, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}





// Command AT+CWSAP_DEF?
// Response +CWSAP_DEF:<ssid>, <pwd>, <chl>, <ecn>, <max conn>, <ssid hidden>
Void __esp8266_Send_AT_CWSAP_DEF_get_cmd() {
    UInt8 send_buf[35] = {0};
    
    sprintf((Char*)send_buf, "AT+CWSAP_DEF?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}



// Command AT+CWSAP_DEF=<ssid>, <pwd>, <chl>, <ecn>[, <max conn>][, <ssid hidden>]
// Response OK 
// ERROR
Void __esp8266_Send_AT_CWSAP_DEF_set_cmd(
    _In_ Char*   ssid, 
    _In_ Char*   pwd, 
    _In_ UInt8 chl, 
    _In_ UInt8 ecn, 
    _In_ Char*   max_conn, 
    _In_ Char*   ssid_hidden
) {
    UInt8 send_buf[35] = {0};
    
    if (max_conn != NULL && ssid_hidden != NULL) {
        sprintf((Char*)send_buf, "AT+CWSAP_DEF=%s, %s, %d, %d, %s, %s%c", ssid, pwd, chl, ecn, max_conn, ssid_hidden, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CWSAP_DEF=%s, %s, %d, %c%c", ssid, pwd, chl, ecn, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}



/**
 * @brief This command is used to get the IP of stations that are connected to ESP8266 softAP.
 * AT+CWLIF– IP of stations which are connected to ESP8266 softAP
 * 
 * @param   IPaddr  IP address of stations which are connected to ESP8266 softAP  
 * @param   mac     MAC address of stations which are connected to ESP8266 softAP
 * 
 * @note This command can not get static IP, it is only available if DHCP is enabled.
 * 
 * @todo test ...
 * 
 *  Response
 *  <IP addr>, <mac>
 *  OK
*/
Void __esp8266_Send_AT_CWLIF_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWLIF%c", (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}
 
 
 
/**
 * @brief
 * 
 * @note  
 * • This configuration will NOT store in Flash user parameter area. 
 * • This configuration interact with static IP related AT commands(AT+CIPSTA related and AT+CIPAP related): 
 *      ‣ If enable DHCP, static IP will be disabled; 
 *      ‣ If enable static IP, DHCP will be disabled; 
 *      ‣ This will depends on the last configuration.
 * 
 * 
*/  
Void __esp8266_Send_AT_CWDHCP_CUR_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWDHCP_CUR?%c", (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
} 
 

// Command AT+CWDHCP_CUR=<mode>, <en>
// Response OK
Void __esp8266_Send_AT_CWDHCP_CUR_set_cmd(UInt8 mode, Bool en) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWDHCP_CUR=%d, %c%c",mode, en, (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CWDHCP_DEF?
// Response DHCP disabled or enabled now?
Void __esp8266_Send_AT_CWDHCP_DEF_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWDHCP_DEF?%c", (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}



// Command AT+CWDHCP_DEF=<mode>, <en>
// Response OK
Void __esp8266_Send_AT_CWDHCP_DEF_set_cmd(UInt8 mode, Bool en) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWDHCP_DEF=%d, %c%c",mode, en, (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}





