rezayazdanparast1376/ESP8266/esp8266_send_command.c
// Command AT+CWDHCPS_CUR?
// Response +CWDHCPS_CUR=<lease time>, <start IP>, <end IP>
Void __esp8266_Send_AT_CWDHCPS_CUR_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWDHCPS_CUR?%c", (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CWDHCPS_CUR=<enable>, <lease time>, <start IP>, <end IP>
// Response OK
/**
 * @param[in] enable 
 *          0 : Disable the settings and use the default IP range. 
 *          1: Enable setting the IP range, parameters below have to be set.
 * @param[in] lease_time    the unit of lease time is minute, range [1, 2880] 
 * @param[in] startIP       start IP of the IP range that can be got from ESP8266 soft-AP DHCP server 
 * @param[in] endIP         end IP of the IP range that can be got from ESP8266 soft-AP DHCP server
*/
Void __esp8266_Send_AT_CWDHCPS_CUR_set_cmd(Bool enable, UInt16 lease_time, Char* startIP, Char* endIP) {
    UInt8 send_buf[35] = {0};

    if (enable == true) {
        sprintf((Char*)send_buf, "AT+CWDHCPS_CUR=%d, %d, %s, %s%c", enable, lease_time, startIP, endIP, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CWDHCPS_CUR=0%c", (Char)CARRIAR_RETURN);
    }
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CWDHCPS_DEF?
// Response +CWDHCPS_DEF=<lease time>, <start IP>, <end IP>
Void __esp8266_Send_AT_CWDHCPS_DEF_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWDHCPS_DEF?%c", (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CWDHCPS_DEF=<enable>, <lease time>, <start IP>, <end IP>
// Response OK
Void __esp8266_Send_AT_CWDHCPS_DEF_set_cmd(Bool enable, UInt16 lease_time, Char* startIP, Char* endIP) {
    UInt8 send_buf[35] = {0};

    if (enable == true) {
        sprintf((Char*)send_buf, "AT+CWDHCPS_DEF=%d, %d, %s, %s%c", enable, lease_time, startIP, endIP, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CWDHCPS_DEF=0%c", (Char)CARRIAR_RETURN);
    }
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CWAUTOCONN=<enable>
// Response OK
Void __esp8266_Send_AT_CWAUTOCONN_set_cmd(Bool enable) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWAUTOCONN=%c%c", enable, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPSTAMAC_CUR?
// Response
// +CIPSTAMAC_CUR:<mac> 
// OK
Void __esp8266_Send_AT_CIPSTAMAC_CUR_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPSTAMAC_CUR?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPSTAMAC_CUR=<mac>
// Response OK
Void __esp8266_Send_AT_CIPSTAMAC_CUR_set_cmd(Char* mac) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPSTAMAC_CUR=%s%c", mac, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPSTAMAC_DEF?
// Response
// +CIPSTAMAC_DEF:<mac> 
// OK
Void __esp8266_Send_AT_CIPSTAMAC_DEF_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPSTAMAC_DEF?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPSTAMAC_DEF=<mac>
// Response OK
Void __esp8266_Send_AT_CIPSTAMAC_DEF_set_cmd(Char* mac) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPSTAMAC_DEF=%s%c", mac, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPAPMAC_CUR?
// Response
// +CIPAPMAC_CUR:<mac> 
// OK
Void __esp8266_Send_AT_CIPAPMAC_CUR_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPAPMAC_CUR?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPAPMAC_CUR=<mac>
// Response OK
Void __esp8266_Send_AT_CIPAPMAC_CUR_set_cmd(Char* mac) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPAPMAC_CUR=%s%c", mac, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPAPMAC_DEF?
// Response
// +CIPAPMAC_DEF:<mac> 
// OK
Void __esp8266_Send_AT_CIPAPMAC_DEF_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPAPMAC_DEF?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPAPMAC_DEF=<mac>
// Response
// OK
Void __esp8266_Send_AT_CIPAPMAC_DEF_set_cmd(Char* mac) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPAPMAC_DEF=%s%c", mac, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPSTA_CUR?
// Response
// +CIPSTA_CUR:<IP> 
// OK
Void __esp8266_Send_AT_CIPSTA_CUR_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPSTA_CUR?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPSTA_CUR=<IP>[, <gateway>, <netmask>]
// Response OK
Void __esp8266_Send_AT_CIPSTA_CUR_set_cmd(
    _In_ Char* IP, 
    _In_ Char* gateway, 
    _In_ Char* netmask
) {
    UInt8 send_buf[35] = {0};

    if (gateway != NULL && netmask != NULL) {
        sprintf((Char*)send_buf, "AT+CIPSTA_CUR=%s, %s, %s%c", IP, gateway, netmask, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CIPSTA_CUR=%s%c", IP, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPSTA_DEF?
// Response
// +CIPSTA:<IP> 
// OK
Void __esp8266_Send_AT_CIPSTA_DEF_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPSTA_DEF?%c", (Char)CARRIAR_RETURN);      

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPSTA_DEF=<IP>[, <gateway>, <netmask>]
// Response OK
Void __esp8266_Send_AT_CIPSTA_DEF_set_cmd(
    _In_ Char* IP, 
    _In_ Char* gateway, 
    _In_ Char* netmask
) {
    UInt8 send_buf[35] = {0};

    if (gateway != NULL && netmask != NULL) {
        sprintf((Char*)send_buf, "AT+CIPSTA_DEF=%s, %s, %s%c", IP, gateway, netmask, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CIPSTA_DEF=%s%c", IP, (Char)CARRIAR_RETURN);      
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPAP_CUR?
// Response
// +CIPAP_CUR:<IP> 
// OK
Void __esp8266_Send_AT_CIPAP_CUR_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

