rezayazdanparast1376/ESP8266/esp8266_send_command.c
    sprintf((Char*)send_buf, "AT+CIPAP_CUR?%c", (Char)CARRIAR_RETURN);      

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPAP_CUR=<IP>[, <gateway>, <netmask>]
// Response OK
Void __esp8266_Send_AT_CIPAP_CUR_set_cmd(
    _In_ Char* IP, 
    _In_ Char* gateway, 
    _In_ Char* netmask
) {
    UInt8 send_buf[35] = {0};

    if (gateway != NULL && netmask != NULL) {
        sprintf((Char*)send_buf, "AT+CIPAP_CUR=%s, %s, %s%c", IP, gateway, netmask, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CIPAP_CUR=%s%c", IP, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPAP_DEF?
// Response
// +CIPAP_DEF:<IP> 
// OK
Void __esp8266_Send_AT_CIPAP_DEF_get_cmd() {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPAP_DEF?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPAP_DEF=<IP>[, <gateway>, <netmask>]
// Response OK
Void __esp8266_Send_AT_CIPAP_DEF_set_cmd(
    _In_ Char* IP, 
    _In_ Char* gateway, 
    _In_ Char* netmask
) {
    UInt8 send_buf[35] = {0};
    
    if (gateway != NULL && netmask != NULL) {
        sprintf((Char*)send_buf, "AT+CIPAP_DEF=%s, %s, %s%c", IP, gateway, netmask, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CIPAP_DEF=%s%c", IP, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CWSTARTSMART 
// Response OK or ERROR
Void __esp8266_Send_AT_CWSTARTSMART_cmd() {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWSTARTSMART%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CWSTARTSMART=<type>
// Response OK or ERROR
Void __esp8266_Send_AT_CWSTARTSMART_set_cmd(UInt8 type) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWSTARTSMART=%c%c", type, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CWSTOPSMART
//  Response OK or ERROR
Void __esp8266_Send_AT_CWSTOPSMART_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWSTOPSMART%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CWSTARTDISCOVER=<WeChat number>, <dev_type>, <time>
// Response OK or ERROR
Void __esp8266_Send_AT_CWSTOPSMART_set_cmd(
    _In_ Char*  WeChat_number, 
    _In_ Char*  dev_type, 
    _In_ UInt32 time
) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWSTARTDISCOVER=%s, %s, %c%c", WeChat_number, dev_type, time, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CWSTOPDISCOVER
// Response OK or ERROR
Void __esp8266_Send_AT_CWSTOPDISCOVER_cmd() {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CWSTOPDISCOVER%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+WPS=<enable>
// Response OK or ERROR
Void __esp8266_Send_AT_WPS_cmd(Bool enable) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+WPS=%c%c", enable, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+MDNS=<enable>, <hostname>, <server_name>, <server_port>
// Response OK or ERROR
Void __esp8266_Send_AT_MDNS_cmd(
    _In_ Bool     enable, 
    _In_ Char*    hostname, 
    _In_ Char*    server_name, 
    _In_ UInt16 server_port
) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+WPS=%d, %s, %s, %c%c", enable, hostname, server_name, server_port, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}





// =================================================== TCP/IP ====================================================
// AT+CIPSTATUS     Get connection status
// AT+CIPDOMAIN     DNS function
// AT+CIPSTART      Establish TCP connection, UDP transmission or SSL connection 
// AT+CIPSSLSIZE    Set the size of SSL buffer
// AT+CIPSEND       Send data
// AT+CIPSENDEX     Send data, if <length> or "\0" is met, data will be sent
// AT+CIPSENDBUF    Write data into TCP-send-buffer
// AT+CIPBUFRESET   Reset segment ID count
// AT+CIPBUFSTATUS  Check status of TCP-send-buffer
// AT+CIPCHECKSEQ   Check if a specific segment is sent or not
// AT+CIPCLOSE      Close TCP/UDP/SSL connection 
// AT+CIFSR         Get local IP address 
// AT+CIPMUX        Set multiple connections mode
// AT+CIPSERVER     Configure as server
// AT+CIPMODE       Set transmission mode
// AT+SAVETRANSLINK Save transparent transmission link to Flash
// AT+CIPSTO        Set timeout when ESP8266 runs as TCP server
// AT+CIUPDATE      Upgrade firmware through network
// AT+PING          Function PING 
// AT+CIPDINFO      Show remote IP and remote port with "+IPD"




// Command AT+CIPSTATUS
// Response
// STATUS:<stat> 
// +CIPSTATUS:<link ID>, <type>, <remote_IP>, <remote_port>, <local_port>, 
// <tetype>
Void __esp8266_Send_AT_CIPSTATUS_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPSTATUS%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPDOMAIN=<domain name>
// Response +CIPDOMAIN:<IP address>
Void __esp8266_Send_AT_CIPDOMAIN_cmd(Char* domain_name) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPDOMAIN=%s%c", domain_name, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}



Bool single_connection = true;
Bool Multiple_connection = true;
// Single connection 
// (AT+CIPMUX=0)
// AT+CIPSTART=  <type>, <remote IP>, <remote port>[, <TCP keep alive>]
// Multiple connection 
// (AT+CIPMUX=1)
// AT+CIPSTART=<link ID>, <type>, <remote IP>, <remote port>[, <TCP keep alive>]

// Response
// OK or ERROR 
// If TCP is connected already, returns 
// ALREADY CONNECT
Void __esp8266_Send_AT_CIPSTART_TCP_cmd(linkID, type, remoteIP, remote_port, TCP_keep_alive) {
    UInt8 send_buf[35] = {0};

    if (single_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPSTART=%s%c", type, remoteIP, remote_port, TCP_keep_alive, (Char)CARRIAR_RETURN);
    }
    if (Multiple_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPSTART=%s%c", linkID, type, remoteIP, remote_port, TCP_keep_alive, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}




