rezayazdanparast1376/ESP8266/esp8266_send_command.c
// Single connection 
// (AT+CIPMUX=0)
// AT+CIPSTART=<type>, <remote IP>, <remote port>[, <UDP local port>, <UDP mode>]
// Multiple connection 
// (AT+CIPMUX=1)
// AT+CIPSTART=<link ID>, <type>, <remote IP>, <remote port>[, <UDP local port>, <UDP mode>]

// Response
// OK or ERROR 
// If connection already exists, returns 
// ALREADY CONNECT
Void __esp8266_Send_AT_CIPSTART_UDP_cmd(linkID, type, remoteIP, remote_port, UDPlocal_port, UDP_mode) {
    UInt8 send_buf[35] = {0};

    if (single_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPSTART=%s%c", type, remoteIP, remote_port, UDPlocal_port, UDP_mode, (Char)CARRIAR_RETURN);
    }
    if (Multiple_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPSTART=%c", linkID, type, remoteIP, remote_port, UDPlocal_port, UDP_mode, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}





// Single connection 
// (AT+CIPMUX=0)
// AT+CIPSTART= <type>, <remote IP>, <remote port>[, <TCP keep alive>]
// Multiple connection 
// (AT+CIPMUX=1)
// AT+CIPSTART=<link ID>, <type>, <remote IP>, <remote port>[, <TCP keep alive>]

// Response
// OK or ERROR 
// If TCP is connected already, returns 
// ALREADY CONNECT
Void __esp8266_Send_AT_CIPSTART_SSL_cmd(linkID, type, remoteIP, remote_port, TCP_keep_alive) {
    UInt8 send_buf[35] = {0};

    if (single_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPSTART=%s%c", type, remoteIP, remote_port, TCP_keep_alive, (Char)CARRIAR_RETURN);
    }
    if (Multiple_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPSTART=%c", linkID, type, remoteIP, remote_port, TCP_keep_alive, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command
// AT+CIPSSLSIZE=<size>
// Response
// OK or ERROR
/**
 * @brief Set the size of SSL buffer 
 * 
 * @param[in]  size   The size of SSL buffer, range: 2048 ~ 4096
*/
Void __esp8266_Send_AT_CIPSSLSIZE_cmd(
    _In_ UInt16 size
) {
    Soft_Assert_Void(size >= 2048 && size <= 4096, "Invalid parameter! size parameter must be in range: 2048 ~ 4096");

    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPSSLSIZE=%s%c", size, (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}





// Single connection (+CIPMUX=0) 
// AT+CIPSEND=<length>

// Multiple connection (+CIPMUX=1) 
// AT+CIPSEND=<link ID>, <length>
Void __esp8266_Send_AT_CIPSEND_cmd(
    _In_ UInt8  linkID, 
    _In_ UInt16 length
) {
    Soft_Assert_Void(linkID <= 4, "Invalid linkID!");
    Soft_Assert_Void(length <= 2048, "Invalind parameter!");

    UInt8 send_buf[35] = {0};

    if (single_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPSEND=%c%c", length, (Char)CARRIAR_RETURN);
    }
    if (Multiple_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPSTART=%d, %c%c", linkID, length, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}



// UDP Transmission AT+CIPSEND=[<link ID>, ]<length>[, <remote IP>, <remote port>]
/**
 * @brief Send data
 * 
 * @param[in] linkID      ID of the connection (0~4), for multi-connect 
 * @param[in] length      data length, MAX 2048 bytes  
 * @param[in] remoteIP    UDP transmission can set remote IP when send data 
 * @param[in] remote_port UDP transmission can set remote port when send data
*/
Void __esp8266_Send_AT_CIPSSLSIZE_UDP_cmd(
    _In_ UInt8  linkID, 
    _In_ UInt16 length,
    _In_ Char*  remoteIP, 
    _In_ UInt16 remote_port
) {
    Soft_Assert_Void(linkID <= 4, "Invalid linkID!");
    Soft_Assert_Void(length <= 2048, "Invalind parameter!");

    UInt8 send_buf[35] = {0};

    if (single_connection == 1) {
        if (remoteIP != NULL) {
            sprintf((Char*)send_buf, "AT+CIPSEND=%d, %s, %c%c", length, remoteIP, remote_port, (Char)CARRIAR_RETURN);
        }
        else {
            sprintf((Char*)send_buf, "AT+CIPSEND=%c%c", length, (Char)CARRIAR_RETURN);
        }
    }
    if (Multiple_connection == 1) {
        if (remoteIP != NULL) {
            sprintf((Char*)send_buf, "AT+CIPSTART=%d, %d, %s, %c%c", linkID, length, remoteIP, remote_port, (Char)CARRIAR_RETURN);
        }
        else {
            sprintf((Char*)send_buf, "AT+CIPSTART=%d, %c%c", linkID, length, (Char)CARRIAR_RETURN);
        }
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}



// Command AT+CIPSEND
/**
 * @brief Send data
 * 
 * @attention  Wrap return ">" after execute command. Enters unvarnished transmission, 20ms interval between each packet, maximum 2048 bytes per packet. 
 * When single packet containing "+++" is received, it returns to normal command mode. Please wait at least 1 second before sending next AT command. 
 * @note
 * This command can only be used in transparent transmission mode which require to be single connection mode.  
 * For UDP transparent transmission, <UDP mode> has to be 0 in command "AT+CIPSTART"
*/
Void __esp8266_Send_AT_CIPSSLSIZE_TT_MODE_cmd(Void) {
    UInt8 send_buf[35] = {0};

    if (single_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPSEND%c", (Char)CARRIAR_RETURN);
    }    

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Single connection (+CIPMUX=0) 
// AT+CIPSENDEX=<length>

// Multiple connection (+CIPMUX=1) 
// AT+CIPSENDEX=<link ID>, <length>

/**
 * @param[in] linkID ID of the connection (0~4), for multi-connect 
 * @param[in] length data length, MAX 2048 bytes
*/
Void __esp8266_Send_AT_CIPSENDEX_cmd(
    _In_ UInt8  linkID, 
    _In_ UInt16 length
) {
    Soft_Assert_Void(linkID <= 4, "Invalid linkID!");
    Soft_Assert_Void(length <= 2048, "Invalind parameter!");

    UInt8 send_buf[35] = {0};

    if (single_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPSEND=%c%c", length, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CIPSEND=%d, %c%c", linkID, length, (Char)CARRIAR_RETURN);
    }
    

    esp8266_uart_send(send_buf, strlen(send_buf));
}




// UDP Transmission AT+CIPSENDEX=[<link ID>, ]<length>[, <remote IP>, <remote port>]
Void __esp8266_Send_AT_CIPSENDEX_UDP_cmd(
    _In_ UInt8  linkID, 
    _In_ UInt16 length,
    _In_ Char*  remoteIP, 
    _In_ UInt16 remote_port
) {
    Soft_Assert_Void(linkID <= 4, "Invalid linkID!");
    Soft_Assert_Void(length <= 2048, "Invalind parameter!");

    UInt8 send_buf[35] = {0};

    if (single_connection == 1) {
        if (remoteIP != NULL) {
            sprintf((Char*)send_buf, "AT+CIPSEND=%d, %s, %c%c", length, remoteIP, remote_port, (Char)CARRIAR_RETURN);       
        }
        else {
            sprintf((Char*)send_buf, "AT+CIPSEND=%c%c", length, (Char)CARRIAR_RETURN);
        }
    }
    else {
        if (remoteIP != NULL) {
            sprintf((Char*)send_buf, "AT+CIPSEND=%d, %d, %s%c%c", linkID, length, remoteIP, remote_port, (Char)CARRIAR_RETURN);
        }
        else {
            sprintf((Char*)send_buf, "AT+CIPSEND=%d, %c%c", linkID, length, (Char)CARRIAR_RETURN);
        }
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * @brief Write data into TCP-send-buffer
 * 
 * @attention This command only write data into TCP-send-buffer, so it can be called continually, needn’t wait for "SEND OK";  
 * if a TCP segment is sent successfully, it will return <segment ID>, SEND OK. 
 * Before data <length> is met, input "+++" can switch back from data mode to command mode, and discard the 
 * data received before, cancel the "AT+CIPSENDBUF". This command can NOT be used on SSL connection.
 * 
 * @param[in] linkID    ID of the connection (0~4), for multi-connect 
 * @param[in] length    data length, data more than <length> will be discarded, MAX 2048 bytes
 * 
 * @param[out] segmentID uint32, starts from 1, add 1 every time be called;
 * 
 * @note 
 * <current segment ID>, <segment ID of which sent successfully> 
 * OK 
 * > 
 * 
 * Wrap return ">" begins receiving of serial data, when data <length> is met, send it; data more than <length> will be discarded, and returns "busy" 
 * 
 * If connection cannot be established, or it’s not a TCP connection , or buffer full, or some other error occurred, returns ERROR 
 * 
 * If data is transmitted successfully,  
 * (1) for single connection, returns <segment ID>, SEND OK 
 * (2) for multiple connection, returns <link ID>, <segment ID>, SEND OK
*/
Void __esp8266_Send_AT_CIPSENDBUF_cmd(
    _In_ UInt8  linkID, 
    _In_ UInt16 length
) {
    UInt8 send_buf[35] = {0};

    if (single_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPSENDBUF=%c%c", length, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CIPSENDBUF=%d, %c%c", linkID, length, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}





/**
 * @brief Check status of TCP-send-buffer
 * 
 * @attention Please do not user this command on SSL connection.
 * 
 * @note Response
 * <next segment ID>, < segment ID of which has sent >, < segment ID of which sent successfully>, <remain buffer size>, <queue number> 
 * OK 
 * 
 * If connection is not established, returns ERROR
*/
Void __esp8266_Send_AT_CIPBUFSTATUS_cmd(
    _In_ UInt16 linkID
) {
    UInt8 send_buf[35] = {0};

    if (single_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPBUFSTATUS%c", linkID, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CIPBUFSTATUS=%c%c", linkID, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * @brief Check if specific segment sent successfully or not
 * 
 * @param[in] segmentID SegmentID got by AT+CIPSENDBUF command 
 * @param[in] LinkID    ID of the connection (0~4), for multi-connect 
 * 
 * @note 
 * [<link ID>, ]<segment ID> , <status> 
 * 
 * OK 
 * 
 * If connection is not established, returns ERROR
 */
Void __esp8266_Send_AT_CIPCHECKSEQ_cmd(
    _In_ UInt16 linkID,
    _In_ UInt16 segmentID
) {
    UInt8 send_buf[35] = {0};

    if (single_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPCHECKSEQ=%c%c", segmentID, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CIPCHECKSEQ=%d, %c%c", linkID, segmentID, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * @brief  Reset segment ID count 
 * @param[in] linkID ID of the connection (0~4), for multi-connect
 * 
 * @note  This command can only be used if AT+CIPSENDBUF  is used
*/
Void __esp8266_Send_AT_CIPBUFRESET_cmd(
    _In_ UInt16 linkID
) {
    UInt8 send_buf[35] = {0};

    if (single_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPBUFRESET%c", (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CIPBUFRESET=%c%c", linkID, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}


// Multiple connection AT+CIPCLOSE=<link ID>
// Response
// OK 
// or 
// ERROR

// Single connection AT+CIPCLOSE
// Response
// OK 
// or 
// If no such connection, returns 
// ERROR
Void __esp8266_Send_AT_CIPCLOSE_cmd(
    _In_ UInt16 linkID
) {
    UInt8 send_buf[35] = {0};

    if (single_connection == 1) {
        sprintf((Char*)send_buf, "AT+CIPCLOSE%c", (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CIPCLOSE=%c%c", linkID, (Char)CARRIAR_RETURN);
    }

    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * @brief  Get local IP address 
 * 
 * @note  Only after ESP8266 station connected to AP, station IP can be got and inquiried.
*/
Void __esp8266_Send_AT_CIFSR_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIFSR%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * @brief multiple connections is enable or not
*/
Void __esp8266_Send_AT_CIFSR_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPMUX?%c", (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * @brief Enable multiple connections 
 * 
 * @param[in] mode  
 * 0  single connection 
 * 1  multiple connection 
 * 
 * @note
 * 1. "AT+CIPMUX=1" can only be set when transparent transmission disabled ( "AT+CIPMODE=0") 
 * 2. This mode can only be changed after all connections are disconnected.  
 * 3. If TCP server is started, has to delete TCP server first, then change to single connection is allowed.
*/
Void __esp8266_Send_AT_CIFSR_set_cmd(Bool mode) {
    UInt8 send_buf[35] = {0};

