rezayazdanparast1376/ESP8266/esp8266_send_command.c
    sprintf((Char*)send_buf, "AT+CIPMUX=%c%c", mode, (Char)CARRIAR_RETURN);

    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * @brief  Configure as TCP server
 * 
 * @param[in] mode 
 * 0  Delete server  
 * 1  Create server 
 * @param[in] port port number, default is 333
 * 
 * @example  [AT+CIPMUX=1] [AT+CIPSERVER=1, 1001]
 * 
 * @note Server can only be created when AT+CIPMUX=1
*/
Void __esp8266_Send_AT_CIPSERVER_cmd(Bool mode, UInt16 port) {
    UInt8 send_buf[35] = {0};

    if (port == 333) {
        sprintf((Char*)send_buf, "AT+CIPMUX=%d, %c%c", mode, port, (Char)CARRIAR_RETURN);
    }
    else {
        sprintf((Char*)send_buf, "AT+CIPMUX=%c%c", mode, (Char)CARRIAR_RETURN);
    }
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * @brief  get transfer mode
 * 
 * @note This configuration would NOT save into Flash.
*/
Void __esp8266_Send_AT_CIPMODE_get_cmd(Void) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPMODE?%c", (Char)CARRIAR_RETURN);   
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * @brief  set transfer mode
 * 
 * @param[in] mode 
 * 0  normal mode  
 * 1  UART-WiFi passthrough mode
 * 
 * @attention 
 * UART-WiFi passthrough mode (transparent transmission) can only be enabled in TCP single connection mode or UDP of which remote IP and port won’t change (parameter <UDP mode> is 0 when using command "AT+CIPSTART" to create a UDP transmission).
 * During UART-WiFi passthrough transmission, if it is TCP connection and the TCP connection breaks, ESP8266 will keep trying to reconnect until "+++" is inputed to quit from transmission. 
 * After "+++", please wait at least 1 second before sending next AT command. If it is a normal TCP transmission and TCP connection breaks, ESP8266 will prompt " [<link ID>, ] 
 * CLOSED" , and won’t try to reconnect. Users can call "AT+CIPSTART" to create a connection again if it’s needed.
 * 
 * @note This configuration would NOT save into Flash.
*/
Void __esp8266_Send_AT_CIPMODE_set_cmd(Bool mode) {
    UInt8 send_buf[35] = {0};

    sprintf((Char*)send_buf, "AT+CIPMODE=%c%c", mode, (Char)CARRIAR_RETURN);   
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}





// For TCP connection: 
// AT+SAVETRANSLINK =<mode>, <remote IP or domain name>, <remote port>[, <type>][, <TCP keep alive>] 
/**
 * @brief Save transparent transmission link to Flash
 * 
 * @param[in] mode 
 *              0 :  normal mode, cancel enter UART-WiFi passthrough mode when power on 
 *              1 :  save UART-WiFi passthrough mode 
 * 
 * @param[in] remote_IP      remote IP or domain name 
 * @param[in] remote_port    remote port 
 * 
 * @param[in] TCP_keep_alive TCP keep alive, default to be disabled 
 *              0: disable TCP keep alive 
 *              1 ~ 7200: keep-alive detect time interval, unit: second 
 * 
 * @example AT+SAVETRANSLINK=1, "192.168.6.110", 1002, "TCP"
 * 
 * @note 
 * This command will save the UART-WiFi passthrough mode and its link into Flash user parameter area, ESP8266 will enter UART-WiFi passthrough mode since next power on. 
 * As long as the IP (or domain name), port conformance to specification, we will save them to Flash
*/
Void __esp8266_Send_AT_SAVETRANSLINK_TCP_cmd(Bool mode, Char* remoteIP, UInt16 remote_port, UInt16 TCP_keep_alive) {
    UInt8 send_buf[55] = {0};
     
    sprintf((Char*)send_buf, "AT+CIPMODE=%d, \"%s\", %d, \"%s\", %c%c", mode, remoteIP, remote_port, "TCP",TCP_keep_alive, (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}




// For UDP transmission: 
// AT+SAVETRANSLINK =<mode>, <remote IP>, <remote port>[, <type>][, <UDP local port>]
/**
 * @brief Save transparent transmission link to Flash
 * 
 * @param[in] mode 
 *              0 :  normal mode, cancel enter UART-WiFi passthrough mode when power on 
 *              1 :  save UART-WiFi passthrough mode 
 * 
 * @param[in] remote_IP      remote IP or domain name 
 * @param[in] remote_port    remote port
 * 
 * @param[in] UDP_local_port local port if enter UDP transparent transmission when power on.
 * 
 * @note
 * This command will save the UART-WiFi passthrough mode and its link into Flash user parameter area, ESP8266 will enter UART-WiFi passthrough mode since next power on. 
 * As long as the IP (or domain name), port conformance to specification, we will save them to Flash
*/
Void __esp8266_Send_AT_SAVETRANSLINK_UDP_cmd(Bool mode, Char* remoteIP, UInt16 remote_port, UInt16 UDP_local_port) {
    UInt8 send_buf[55] = {0};
     
    sprintf((Char*)send_buf, "AT+CIPMODE=%d, \"%s\", %d, \"%s\", %c%c", mode, remoteIP, remote_port, "UDP", UDP_local_port, (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}





// Command AT+CIPSTO?
Void __esp8266_Send_AT_CIPSTO_get_cmd(Void) {
    UInt8 send_buf[35] = {0};
     
    sprintf((Char*)send_buf, "AT+CIPSTO?%c", (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}




// Command AT+CIPSTO=<time>
/**
 * @brief Set TCP server timeout
 * 
 * @param time TCP server timeout, range 0~7200 seconds 
 * 
 * @note  ESP8266 as TCP server, will disconnect to TCP client that didn’t communicate with it even if timeout. 
 * If AT+CIPSTO=0, it will never timeout. We don’t recommend that.
 * 
*/
Void __esp8266_Send_AT_CIPSTO_set_cmd(UInt16 time) {
    UInt8 send_buf[35] = {0};
     
    sprintf((Char*)send_buf, "AT+CIPSTO=%c%c", time, (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * @brief Function Ping 
 * 
 * @param[in] IP string, host IP or domain name 
*/
Void __esp8266_Send_AT_PING_cmd(Char* IP) {
    UInt8 send_buf[35] = {0};
     
    sprintf((Char*)send_buf, "AT+PING=\"%s\"%c", IP, (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * @brief Update through network
*/
Void __esp8266_Send_AT_CIUPDATE_cmd(Void) {
    UInt8 send_buf[35] = {0};
     
    sprintf((Char*)send_buf, "AT+CIUPDATE%c", (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}




/**
 * @brief Show remote IP and port with "+IPD"
 * Show remote IP and port with "+IPD" (received data from network)
 * 
 * @param mode 
 *          0: will not show remote IP and port with "+IPD" 
 *          1: show remote IP and port with "+IPD"
*/
Void __esp8266_Send_AT_CIPDINFO_cmd(Bool mode) {
    UInt8 send_buf[35] = {0};
     
    sprintf((Char*)send_buf, "AT+CIPDINFO=%c%c", mode, (Char)CARRIAR_RETURN);
    
    esp8266_uart_send(send_buf, strlen(send_buf));
}
